rrr/aaadata/AD.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <GetAD xmlns="https://tempuri.org">
      <ErrInfo/>
      <FC>0</FC>
      <IsTitleWhiteLight>false</IsTitleWhiteLight>
      <ADName/>
      <ShowTime>0</ShowTime>
      <ClickURL/>
    </GetAD>
  </soap:Body>
</soap:Envelope>